[
  {
    "img": "/profile-photos/plantbuilt-amber-sperling.png",
    "name": "Amber Sperling",
    "active": false,
    "sport": "cf"
  },
  {
    "img": "/profile-photos/plantbuilt-arvid-beck.png",
    "name": "Arvid Beck",
    "active": false,
    "sport": "bodybuilding"
  },
  {
    "name": "Brittany Billings",
    "active": true,
    "sport": "powerlifting",
    "img":"/profile-photos/plantbuilt-brittany-billings.png",
    "social": [{"key": "Instagram", "value": "https://www.instagram.com/Brittanypb09"}],
    "bio": [{"key":"Age","value":"35"},{"key":"Hometown/city","value":"Fort Wayne, Indiana"},{"key":"Height","value":"5’7"},{"key":"Weight","value":"180 lbs."},{"key":"Division(s) you will compete in","value":"Powerlifting"},{"key":"Competition Weight","value":"82.5 kg"},{"key":"Current max lifts","value":"Bench/Squat/Deadlift 150/225/250"},{"key":"Years as a vegan","value":"6"},{"key":"Why you became a Vegan","value":"I’ve always been an animal lover but it wasn’t until I was years into being a vegetarian that I truly understood the harm that the dairy industry causes. I started to do research and one night I decided to watch the documentary Earthlings. I was only able to watch about 15 minutes of it before I decided then and there that I would never be the cause of animal suffering again. There is no food or product worth the millions of animals living in misery and thousands that have unnecessarily had their lives taken even in the time it’s taken me to type this. Although animals will always be the reason I’m vegan, the added environmental and physical benefits are icing on the cake."},{"key":"What drives you to compete", "value": "Challenging myself and accomplishing goals I set for myself."},{"key":"What do you see as the biggest advantages of being a vegan athlete","value":"Other than significantly improved recovery time, breaking stereotypes as a vegan. I love when people come up to talk to me at the gym or ask questions and I get to share my journey with them and show them that you can thrive on a vegan diet."},{"key":"What types of supplements if any do you use?","value":"Creatine, a multivitamin, and b12. I’m not too picky with brands as long as the ingredients are good."},{"key":"How would you describe your diet/nutrition leading up to a meet","value":"I eat quite a bit of protein and carbs. Anytime I have any type of competition coming up, I try to eat more whole foods since that’s what I’ve found usually makes me feel best."},{"key":"Favorite foods/meals","value":"Seitan is my favorite food. It’s so versatile that I could eat it for every meal (and sometimes do). My favorite meal is anything Mexican."},{"key":"How would you describe your training for a competition","value":"Whatever Dani tells me to do Lower reps and higher weight usually. It’s my favorite kind of training."},{"key":"Favorite exercises","value":"Deadlifts and anything shoulders."},{"key":"How many hours a week do you spend training?","value":"About 7 hours."},{"key":"Today I am most proud of","value":"Making the conscious choice to put animal’s needs about my own."}]
  },
  {
    "img": "/profile-photos/plantbuilt-carolyn-johnson.png",
    "name": "Carolyn Johnson",
    "active": true,
    "sport": "olympic-weightlifting",
    "social": [{"key": "Instagram", "value":"https://www.instagram.com/olyn_86"}, {"key": "Facebook","value": "https://www.facebook.com/carolyn.napier.9"}]
  },
  {
    "img": "/profile-photos/plantbuilt-christian-garcia.png",
    "name": "Christian Garcia",
    "active": false,
    "sport": "bodybuilding"
  },
  {
    "img": "/profile-photos/plantbuilt-dani-taylor.png",
    "name": "Dani Taylor",
    "active": true,
    "sport": "bodybuilding"
  },
  {
    "img": "/profile-photos/plantbuilt-daniel-albaugh.png",
    "name": "Daniel Albaugh",
    "active": true,
    "sport": "powerlifting",
    "bio": [{"key":"Age","value":"39"},{"key":"Hometown/city","value":"San Marcos, TX"},{"key":"Height","value":"5’7”"},{"key":"Weight","value":"~172 (daily)"},{"key":"Division(s) you will compete in","value":"Open, Raw, Submasters"},{"key":"Competition Weight","value":"165"},{"key":"Current max lifts","value":"Bench/Squat/Deadlift"},{"key":"Years as a vegan","value":"17"},{"key":"Why you became a Vegan","value":"Strictly FOR THE ANIMALS. All the health and strength perks have just been happy accidents."},{"key":"Competition history","value":["July 15, 2021 USPA Drug Tested National Championship (Palm Springs, CA) Bodyweight"]},{"key":"What drives you to compete","value":"Competing brings out the best in my performance and the most in my ambition. I don’t always beat everyone in my categories, but being competitive keeps my drive alive to beat the previous, weaker versions of myself. I also love the camaraderie in competition."},{"key":"What do you see as the biggest advantages of being a vegan athlete","value":"I’m not always sure being vegan is advantageous for strength athletes, but I will say that I have never had a major injury in over a decade of lifting, I’ve continually gotten stronger on a vegan diet, and I’ve remained hormonally healthy as I approach 40 years of age. Not many people eating animals can say half as much about their progress or health this far into the game. Given that, I’ll definitely say veganism is at least no disadvantage for strength – if you know how to manage your diet and life. I also believe veganism gives you added purpose for being athletic, which is an advantage regarding motivation. Being vegan means I always, always, always have to represent for something bigger than myself"},{"key":"What types of supplements if any do you use?","value":"Protein powder, B12, D3, Creatine, Glutamine, Glucosamine, Zinc, Omega 3 (algae-based DHA/EPA), Magnesium, occasional herbal T-booster"},{"key":"How would you describe your diet/nutrition leading up to a meet","value":"A couple months before a meet, I start cleaning up my diet, making sure I don’t splurge too often, and I begin to stay strict with the kind of diet in my book, The Way of The Vegan Meathead- Eating for Strength. In the very last week leading up to a meet, I will water-load (overdrink water) for a couple days, then ween off water the last couple days (completely cutting all food and liquid consumption about 15-hours before weigh-in). That final week is when my eating gets super clean"},{"key":"Favorite foods/meals","value":"Arlo’s Burgers (Austin, TX), The Lumberjack at Brunch Bird (Austin, TX), al pastor tacos, vegan soul food, garlic fried tofu, pancakes"},{"key":"How would you describe your training for a competition","value":"I find 6 or 7 week peaking cycles are best for me to eke out some new gains for the platform. If I extend my program too much longer, I get burned out and stagnate. The first couple weeks will be volume accumulation, then I will begin to focus on intensity acclimation, and on the last couple weeks before maxing I am getting into heavy weight/high intensity territory (triples and doubles around 90% or above) while volume drops off so I can recover."},{"key":"Favorite exercises","value":"The big 3"},{"key":"How many hours a week do you spend training?","value":"Only 6-8 (Praise powerlifting! I have a life outside the gym!)"},{"key":"Today I am most proud of","value":"2 Drug-Tested USPA National Championship gold medals, 1 IPL World Championship silver medal, getting my deadlift well over 3x bodyweight, and my perfect 9 for 9 performance with my PlantBuilt teammates in 2017."}],
    "social": [{"key": "Website", "value": "www.veganmeathead.com www.daniel-austin.com"}, {"key": "Instagram", "value": "https://www.instagram.com/veganxmeathead"}, {"key": "Facebook", "value": "https://www.facebook.com/veganxmeathead"}, {"key": "Youtube", "value": "https://www.youtube.com/channel/UC4R9b7Vdg14QtWvDuoY2klw"}]
  },
  {
    "name":"Ed Bauer",
    "active": true,
    "bio": [{"key":"Name","value":"Ed Bauer"},{"key":"Age","value":"42"},{"key":"Hometown/city","value":"Norfolk, VA"},{"key":"Height","value":"5’9”"},{"key":"Weight","value":"175lbs"},{"key":"Division(s) you will compete in","value":"Men’s Physique Masters (40+)"},{"key":"Competition Weight","value":"175"},{"key":"Years as a vegan","value":"26"},{"key":"Why you became a Vegan","value":"To stop the torture and murder of all sentient beings"},{"key":"Competition history","value": ["2010 NPC Bill Pearl High Desert Classic (Bend, OR) – 1st in Novice Middleweight Bodybuilding", "2011 NANBF Washington State Championships (Seattle, WA) – 4th in Open Short Class Bodybuilding", "2013 INBF Men’s Physique (Austin, TX) 2nd Place Fit Model Men", "2016 May 8th, 2016 Old Skool Iron Classic Powerlifting Meet – 2nd Place in Sub-Masters Division"]},{"key":"What drives you to compete","value":"To prove to the world that veganism and my determination can build a healthy, lean, and muscular body."},{"key":"What do you see as the biggest advantages of being a vegan athlete","value":"One of the biggest advantages is the ability to recover faster because of the amount of nutrient dense foods in a whole foods plant based diet. We are also living in a time where speciesism is allowing humankind to commit inconceivable atrocities on other living creatures. I am passionately driven to be a part of this change that sees non-human animals as living beings that deserve to live their lives free from pain and suffering, just as any of us would want. My role of being a vegan ambassador (Olympic Lifter, Powerlifter, CrossFit athlete, Bodybuilder, etc.) is far more driven than someone who simply is in it to fulfill their ego. This is a huge advantage."},{"key":"What types of supplements if any do you use?","value":"Creatine, Glutamine, PlantFusion Protein Powder, a Pre-Workout Formula, Digestive Enzymes, DHA Algal Oil, and ZMA for recovery"},{"key":"How would you describe your diet/nutrition leading up to a show","value":"For the cutting phase, I would describe it as low carb, plant based whole foods diet, with a good amount of beans, tempeh, seitan, tofu, some veg meats like “Tofurky” or “Beyond Meat,” and protein powder to balance out my macronutrients. I load carbohydrates around weight lifting, but limit them other times of the day."},{"key":"Favorite foods/meals","value":"Tofu Chick’n Salad on a Low Carb Wrap with Clean Machine Fruit Punch BCAAs to drink."},{"key":"How would you describe your training for a competition","value":"I do 5 days of week of muscle specific hypertrophy training, and 4 to 6 days of fasted cardio to aid in fat loss."},{"key":"Favorite exercises","value":"Dumbbell Chest Press, Dips, and Back Squats."},{"key":"How many hours a week do you spend training?","value":"10 hours"},{"key":"Today I am most proud of","value":"Deadlifting 507 lbs, benching 315 lbs, Squatting 418lbs, Showing people that you can be lean and strong on a completely plant-based diet, as well as owning NewEthic Strength & Conditioning in Norfolk, Virginia."}],
    "sport": "bodybuilding",
    "social": [{"key": "Website", "value": "https://newethicgym.square.site/"}, {"key": "Instagram", "value": "https://www.instagram.com/edbauerfit"},{"key": "Instagram", "value": "https://www.instagram.com/thenewethic"}, {"key": "Facebook", "value": "https://www.facebook.com/ed.bauer.589/"}],
    "img": "/profile-photos/plantbuilt-ed-bauer.png"
  },
  {
    "name": "Emily Wilson",
    "img": "/profile-photos/plantbuilt-emily-wilson.png",
    "sport": "cf",
    "active": true,
    "bio": [{"key":"Age","value":"34"},{"key":"Hometown/city","value":"McCall, Idaho"},{"key":"Height","value":"5’2"},{"key":"Weight","value":"120"},{"key":"Division(s) you will compete in","value":"individual rx’d"},{"key":"Competition Weight","value":"120-125"},{"key":"Current best lifts, scores, etc:"},{"key":"BSQ","value":"185, DL"},{"key":"Years as a vegan","value":"3+"},{"key":"Why you became a Vegan","value":"For the animals. I refuse to participate in a system that is inherently violent and causes mass amounts of suffering to living beings. I want to contribute as little as possible to the suffering on this planet."},{"key":"History competing","value":"I have been training and coaching in CrossFit for over 11 years. I have participated in a few local competitions and have contributed scores to qualify CrossFit teams for regionals but honestly, competing has not been my main focus. My primary focus is to be fit, healthy, muscular, and have fun in life, and my dedication to crossfit has been one major avenue that’s allowed me to do this."},{"key":"What drives you to compete","value":"Representing for the animals and a vegan lifestyle."},{"key":" What do you see as the biggest advantages of being a vegan athlete","value":"Improved and increased recovery. Knowing that my success and accomplishments as an athlete aren’t dependent on taking another’s life."},{"key":"What types of supplements if any do you use?","value":"Vitamin supplements including D, B12, Zinc, Turmeric as well as protein powder."},{"key":"How would you describe your diet/nutrition leading up to a competition","value":"Focus on high quality, nutrient dense foods and making sure I’m eating enough to fuel performance."},{"key":"Favorite foods/meals","value":"Can never get enough stir fry with veggies, tofu and rice. I LOVE pasta topped with marinara, lots of nooch and loads of veggies. Wraps/tacos are so easy and satisfying. Go-to breakfast is loaded oatmeal with all kinds of yummy things like spinach, berries, nut butter, flax meal, maple syrup and plant milk."},{"key":"How would you describe your training for a competition","value":"Focus is on developing and increasing my conditioning capacity, muscular endurance, cardiovascular endurance, strength building, and gymnastics skills. Gotta focus on recovery and sleep too. Mobility work and body work is key."},{"key":"Favorite exercises","value":"SQUATS. I love squatting. I love the olympic lifts - snatch and clean and jerk. And I love gymnastics movements like muscle ups and handstands of all kinds."},{"key":"How many hours a week do you spend training?","value":"7+"},{"key":"Today I am most proud of","value":"My commitment and resolve to weightlifting consistently, to choosing to leave animals off my plate, and to personal growth and evolution. The inner work I’ve done to heal myself (mentally, emotionally) from the inside out and how it has transformed my relationship with myself and with every person in my life."}],
    "social": [{"key": "Instagram", "value": "https://www.instagram.com/emilylouisefitness"}, {"key": "Facebook", "value": "https://www.facebook.com/emily.owens.75"}]
  },
  {
    "name": "George Mathews",
    "img": "/profile-photos/plantbuilt-no-photo.png",
    "active": true,
    "sport": "cf",
    "bio": [{"key":"Name","value":"George Matthews"},{"key":"Age","value":"37"},{"key":"Hometown/city","value":"Oxnard, California"},{"key":"Height","value":"5’7"},{"key":"Weight","value":"160"},{"key":"Division(s) you will compete in","value":"CrossFit"},{"key":"Competition Weight","value":"160 Current best lifts, scores, etc"},{"key":"Years as a vegan","value":"10"},{"key":"Why you became a Vegan","value":"In 2008, I was in Navy flight school...and I treated my body like garbage. I drank too much, ate whatever terrible foods I could get my hands on, and barely slept or exercised. As a result, I had constant sinus infections. I had multiple sinus surgeries and was constantly on antibiotics, but nothing worked. I wasn’t medically qualified to fly and was on the verge of getting medically disqualified from flight school. Remarkably, one of the flight surgeons suggested I eliminate dairy from my diet. I didn’t make any sense to me at the time, but I tried it, and almost overnight my sinus problems disappeared. Realizing the impact a small dietary change had on my health I got very curious. I started eliminating more and more animal products and felt better every step of the way. While researching veganism, I not only realized the harm my diet caused to me, but the harm it caused to animals and the environment. I realized that I never wanted to hurt any living being and that I needed to live a lifestyle that embodied that."},{"key":"Your ranking","value":"Finished 94th percentile worldwide (96th percentile for age 35-39) in 2022 Crossfit Open."},{"key":"What drives you to compete","value":"I want to inspire others and help people find their fitness. When I was going through the worst times in my life, I discovered fitness. Since then, I have improved every day both mentally and physically. I believe that the daily struggles we go through in the gym, help us through our daily struggles in life. I want to help other people find fitness and win at their own lives. More specifically, as a vegan athlete, I am driven to prove what is possible on a vegan diet and inspire others to think about the impact of their food choices."},{"key":"What do you see as the biggest advantages of being a vegan athlete","value":"My recovery is incredible. CrossFit workouts are extremely demanding and the training volume can be intense. The vegan diet is packed with nutrients and anti-inflammatory foods which allow me to recover fast. More importantly, I love that my lifestyle minimizes harm to animals and the environment."},{"key":"What types of supplements if any do you use?","value":"I keep it pretty simple and only take creatine monohydrate, multivitamin, and B12."},{"key":"How would you describe your diet/nutrition leading up to a competition","value":"I still stick to my bodybuilding habits when it comes to diet. I track all my intake 5-6 days a week and allow myself some freedom on weekends when I usually do some longer workouts. I have a flexible diet with around 3,000 calories a day. 170 g protein / 380 g Carb / 90 g fat. I eat mostly whole foods, but fit in any vegan foods that I am craving."},{"key":"Favorite foods/meals","value":"Vegan Pizza, Bozzarella burger with Giacomo, whatever my amazing wife Natalie makes me."},{"key":"How would you describe your training for a competition","value":"My training is constantly varied and includes endurance, olympic weightlifting, strength training, and gymnastics. On my rest days, I will typically Mountain bike, road bike, run, or surf. Every once in a while, I also like to do some bodybuilding and just get a nice pump!"},{"key":"Favorite exercises","value":"Deadlift, Muscle-up, handstand walking"},{"key":"How many hours a week do you spend training?","value":"I train CrossFit for 2-3 hours a day 5 days a week. I also coach CrossFit for about 15 hours a week. I spend most of my days living at the gym."},{"key":"Today I am most proud of","value":"Being a husband. Of all the things I’ve done in my life, marrying Natalie is what I am most proud of. I have done some other cool stuff, but I couldn’t have done it without her support, and it wouldn’t have mattered without her to share it with."}],
    "social": [{"key": "Instagram", "value": "https://www.instagram.com/georgeritchiematthews"}, {"key": "Facebook", "value": "https://www.facebook.com/george4385"}, {"key": "YouTube", "value": "https://www.youtube.com/channel/UCjSLwf28H3HWetwKvAfmRxg"}]
  },
  {
    "img": "/profile-photos/plantbuilt-giacomo-marchese.png",
    "name": "Giacomo Marchese",
    "active": true,
    "sport": "bodybuilding",
    "bio": [{"key":"Name","value":"Giacomo Marchese"},{"key":"Age","value":"41"},{"key":"Hometown/city","value":"Brooklyn, NY"},{"key":"Height","value":"5’10.5”"},{"key":"Weight","value":"195 lb"},{"key":"Division(s) you will compete in","value":"Men’s Bodybuilding"},{"key":"Competition Weight","value":"155 lb"},{"key":"Years as a vegan","value":"18yrs"},{"key":"Why you became a Vegan","value":"Started for health reasons and it stuck as a lifestyle. Being vegan to me personally means leaving less of a footprint on this earth, while making compassionate choices. Doing as little harm as possible while here and respecting all sentient life. Other living creatures are not mine to exploit, abuse, or kill for consumption."},{"key":"Competition history","value":["2002 INBF (Brooklyn, NY) All Natural Bodybuilding Fitness Explosion – 1st place", "2009 INBF (Phoenix, AZ) Best of the West Championships – 6th place", "2009 INBA (Clackamas, OR) INBA Northwestern USA – 2nd place", "2013 INBF (Austin, TX) NFSS Super Show – 3rd place", "2014 INBF (Austin, TX) Naturally Fit Games – 4th place", "2015 NFF (Austin, TX) Naturally Fit Games – 2nd place", "2015 OCB (Newburyport, MA) Yankee Classic – 4th place", "2015 OCB (Burlington, NJ) Battle for the Belt – 1st place", "2015 OCB (Biddeford, ME) Maine Event – TBA", "2016 USAPL MA&RI State Championships - 82kg, 19th place (Squat 391lb, Bench 270lb, Deadlift 468lb)", "2016 USAPL Newport RI Open - 82kg, 6th place (Squat 402lb, Bench 265lb, Deadlift 485lb)", "2017 USPA CT Spring Classic - 82kg, 2nd place (Squat 418lb, Bench 259lb, Deadlift 518lb)", "2017 USPA TX Open2nd place - 82kg, 1st place (Squat 424lb, Bench 265lb, Deadlift 534lb), 28/28 all white lights", "2017 Northeast Regional Championships - 82kg, 9th place (Squat 418lb, Bench 253lb, Deadlift 501lb)"]},{"key":"What drives you to compete","value":"It is a chance prove what the human body is truly capable of by natural means form a selfish standpoint. It also fuels the competitive side of me. Becoming a carrier athlete in this sport feels right because I am doing for a reason greater than myself. Leading by example you get to show others what a compassionate cruelty free body looks and can feel like all while taking care of your own health."},{"key":"What types of supplements if any do you use?","value":"Creatine, Citrulline Malate, Beta alanine, L-Carnitine, Caffeine, Multivitamin, Ashwaganda, B complex, B12, D3, DHA/EPA, Zinc Citrate"},{"key":"How would you describe your diet/nutrition leading up to a show","value":"Nutrient dense foods. Calories are down and digestion gets taxed so it’s important to keep the focus on nutrient dense foods. And to keep protein up to prevent muscle tissue wasting while in a deficit. Also mostly bland foods and no artificial stuff as the science shows it is easier to bear the stress of a serve calorie deficit when you don’t overwhelm your palette with highly flavorful foods. Still like to keep it flexible though and have whatever here and there."},{"key":"Favorite foods/meals","value":"Dark green leafy veggies, Beyond Beef/Sausage/burgers, Avocado, and tomato for dinner on prep. I am a sucker for vegan pizza and anything that will satisfy an insatiable sweet tooth when eating out with family and friends."},{"key":"How would you describe your training for a competition","value":"I train as much as my body will allow me to and prioritize sleep to help with an under recovered body that is being challenged to do more. Typically 5-6 days a week for 45min a session. Also like to get in 20-40min of walking a day to keep steps up around 10k. Cardio when necessary."},{"key":"Favorite exercises","value":"Side lateral raises, preacher curls, tricep extensions, close grip lat pulldowns, chest supported dumbbell rows"},{"key":"How many hours a week do you spend training?4.5 hrs resistance training, 3.5hrs walking"},{"key":"Today I am most proud of","value":"Training cumulatively for 25yrs worth of my life. And even with taking an 8yr hiatus from lifting, i’ve trained consistently for the past 10+ yrs with the intention to to advance as a competitive bodybuilder."}],
    "social": [{"key": "Website", "value": "https://www.veganproteins.com/"}, {"key": "Instagram", "value": "https://www.instagram.com/musclesbybrussels"}, {"key": "Facebook", "value": "facebook.com/groups/musclesbybrussels"}, {"key": "YouTube", "value": "https://www.youtube.com/user/VeganProteins"}, {"key": "Podcast", "value": "https://www.veganproteins.com/category/podcast/"}]
  },
  {
    "name":"Holly Noll",
    "img": "/profile-photos/plantbuilt-no-photo.png",
    "active": true,
    "sport": "olympic-weightlifting",
    "bio": [],
    "social": []
  },
  {
    "name":"Jehina Malik",
    "img": "/profile-photos/plantbuilt-jehina-malik.png",
    "active": false,
    "sport": "bodybuilding",
    "bio": [{"key":"Legacy Team Member","value":"Bio accurate in 2017"},{"key":"Name","value":"Jehina Malik"},{"key":"Division you will compete in","value":"Women's Light Weight Bodybuilding and Women's Physique"},{"key":"Height","value":"5'1"},{"key":"Weight/Competition Weight","value":"130-128 off season, 118-116 competition weight"},{"key":"City","value":"Brooklyn"},{"key":"Years as a vegan","value":"Since Birth"},{"key":"Why you became a Vegan","value":"Because I was born this way and continue to stay vegan because I feel it's the best thing for my body"},{"key":"Competition History","value":"Started in 1999 winning my first teenage bodybuilding show and continued with many more shows and wins"},{"key":"What drives you to compete","value":"I grew up skinny and small and having so many naysayers. I also have a passion for the human anatomy and love to witness my physique alter and transform before my eyes"},{"key":"What do you see as the biggest advantages of being a vegan athlete","value":"For me is breaking all the stereotypes and barriers that vegans can't bodybuild"},{"key":"What types of supplements if any do you use?","value":"Lots of vitamin C, B12, multi, PQQ, glutamine, bcaa's, pre workouts at times, extra calcium/potassium and colloidal silver"},{"key":"How would you describe your diet while preparing for a competition","value":"Very very strict, clean and precise"},{"key":"Favorite food in your prep diet","value":"Cashews"},{"key":"How would you describe your training for a competition","value":"Very intense"},{"key":"Favorite exercises","value":"Leg Press, Pull Ups and Pec Flys"},{"key":"How many hours a week do you spend training?","value":"12-14hrs"},{"key":"Today I am most proud of","value":"Winning the biggest show this year, Eastern USA's that was Nov.16, 2013. Furthermore, the first time competing in women's physique division and winning overall and breaking boundaries!."}],
    "social": [{"key": "Instagram", "value": "https://www.instagram.com/ifbbprojehina"}]
  },
  {
    "name": "Jenny Harrison", 
    "sport": "bodybuilding",
    "img": "/profile-photos/plantbuilt-jennifer-harrison.png",
    "active": true,
    "bio": [{"key":"Age","value":"36"},{"key":"Hometown/city","value":"Los Angeles"},{"key":"Height","value":"5’-5”"},{"key":"Weight","value":"124 lbs."},{"key":"Division(s) you will compete in","value":"Women’s Pro Bikini"},{"key":"Competition Weight","value":"105 lbs."},{"key":"Years as a vegan","value":"10"},{"key":"Why you became a Vegan","value":"Due to the passing of my father from heart failure, I became interested in learning about preventative health measures for myself to live a longer, healthier life. Veganism kept popping up again and again, and once I studied the science behind the diet, it just clicked and made sense. From that point, since I was already following a vegan diet for health reasons, I became more open to learning about the animal cruelty aspects caused from the typical American diet. From that point forward, it was a done deal for me. I became fully vegan in all aspects of my lifestyle beyond just diet."},{"key":"Competition history","value":["2019 – WNBF Wayman White Champions Pro Invitational - 2nd place (pro)", "2019 – WNBF Pro American - 1st place (pro)", "2018 – Muscle Beach - 2nd place (open)", "2018 – INBF Hollywood Supernatural - 1st place (pro card win)", "2018 – INBF LA - 2nd place (open)", "2017 – INBF Muscle Mayhem - 2nd place (open)", "2017 – INBF LA - 1st place (novice)"]},{"key":"What drives you to compete","value":"The personal challenge and the love of competition"},{"key":"What do you see as the biggest advantages of being a vegan athlete","value":"Knowing no animals were harmed in the making of these GAINZ. But also not feeling tired or sluggish, and experiencing a quicker recovery time."},{"key":"What types of supplements if any do you use?","value":"Creatine, Lucine, Multivitamins"},{"key":"How would you describe your diet/nutrition leading up to a show","value":"More whole foods are incorporated then in the off season. Lots of fresh veggies and greens are so important not only to feel full, but also for the many micronutrients they offer. Since calories are dropping leading into a show it’s important the foods I do eat give me a bang for my buck."},{"key":"Favorite foods/meals","value":"If I could live off refried beans, I would. But I also enjoy tacos made with seitan or soy curls and veggies. I love protein pasta with vegan sausage or chicken, and when the time’s right who doesn’t love a good Impossible burger and fries?"},{"key":"How would you describe your training for a competition","value":"Training for a competition looks a lot like training during the off season. The only difference is more cardio is incorporated to supplement the deficit in the diet. For me personally, this means I’m weightlifting about 1.25-1.5 hours (5) days a week, and then adding in more and more cardio after my weight lifting sessions as I get closer to the competition."},{"key":"Favorite exercises","value":"It’s no surprise as a bikini competitor my favorite excelsis are for the glutes and delts. My top 2 exercises being hip thrusts and lateral raises."},{"key":"How many hours a week do you spend training?","value":"During the off-season, I’m weightlifting about 1.25-1.5 hours (5) days a week and doing about 20 minutes of cardio 3-4 times a week. During competition season, the only thing that changes is cardio is greatly increased leading into a show."},{"key":"Today I am most proud of","value":"I’m most proud of my consistency and goal-oriented drive. These are my top personality traits that have gotten me pretty far, not only in weightlifting and competition, but also in life. I’m pretty proud of the life I’ve built for myself personally as well as professionally and think that is due to the fact that once I set I goal for myself, nothing stands in my way."}],
    "social": [{"key": "Instagram", "value": "https://www.instagram.com/jennybean__"}]
  },
  {
    "img": "/profile-photos/plantbuilt-jillian-salomone.png",
    "name": "Jillian Salomone",
    "active": false,
    "sport": "bodybuilding"
  },
  {
    "name":"Justin Karstetter",
    "active": true,
    "bio": [{"key":"Age","value":"45"},{"key":"Hometown/city","value":"Glendale Heights"},{"key":"Height","value":"6’0”"},{"key":"Weight","value":"210"},{"key":"Division(s) you will compete in","value":"Men’s Masters Classic physique"},{"key":"Competition Weight","value":"180"},{"key":"Years as a vegan","value":"16 years"},{"key":"Why you became a Vegan","value":"I was so intrigued of a possibility of living a life of solely of plants! I first learned the actual definition of a “vegan” back in 1999 from a Veggie friend while I was attending SIU. It wasn’t until 2005 - when I had talked with Robert Cheeke; via the MySpace days. I changed my diet within 2 weeks and I lost 60 pounds within the next 3 months. I made the “connection” in the next couple of years later while participating in Chicago area Animal Rights demonstrations, and assisting with Bully Breed & Farm rescues."},{"key":"Competition history","value":["2003 NANBF MIDWESTERN NATURAL CLASSIC - NOVICE MEN - Medium - Tall - 2nd Place", "2003 FOREST CITY NATURAL CLASSIC - NOVICE MEN - Medium - 3rd Place"]},{"key":"What drives you to compete","value":"After two recent major surgeries, I want to express gratitude in what I can accomplish while thriving on a Plant-based diet."},{"key":"What do you see as the biggest advantages of being a vegan athlete","value":"My cardiovascular endurance significantly increased."},{"key":"What types of supplements if any do you use?","value":"BCAA, Creatine"},{"key":"How would you describe your diet/nutrition leading up to a show","value":"I slowly reduce my overall caloric intake, meal prep & portion control; also removing excess fats and sugars."},{"key":"Favorite foods/meals","value":"Pineapples and Cherries....Green smoothies...Then Pizza, burgers, and tater tots"},{"key":"How would you describe your training for a competition","value":"I implement more intense cardio sessions."},{"key":"Favorite exercises","value":"Kettlebell snatches, Incline presses, Tricep dips"},{"key":"How many hours a week do you spend training?","value":"4-6 hours"},{"key":"Today I am most proud of","value":"I recovered from a shattered right side collarbone and two torn rotator cuffs."}],
    "sport": "bodybuilding",
    "social": [{"key": "Instagram", "value": "https://www.instagram.com/karpowr"}, {"key": "Facebook", "value": "https://www.facebook.com/justin.karstetter"}],
    "img": "/profile-photos/plantbuilt-justin-karkstetter.png"
  },
  {
    "name":"Katya Gorbacheva",
    "img": "/profile-photos/plantbuilt-ekaterina-gorbacheva.png",
    "active": true,
    "bio": [{"key":"Age","value":"30"},{"key":"Hometown/city","value":"Voronezh, Russia/Durham, NC (kinda – I went to Duke and have become an adult here)."},{"key":"Height","value":"5’ 6”"},{"key":"Weight","value":"71 kg / 156 lb"},{"key":"Division(s) you will compete in","value":"75 kg open in 2022, 69kg open in 2021"},{"key":"Competition Weight","value":"72.5 kg in 2022, 68 kg in 2021"},{"key":"Current max lifts","value":"Bench/Squat/Deadlift 85 kg / 187 lb Bench / 155 kg / 342lb Squat 167.5 kg / 369 lb Deadlift = 3.19.2022 Meet PRs"},{"key":"Years as a vegan","value":"5"},{"key":"Why you became a Vegan","value":"I’ve considered myself healthy for the majority of my life, but was very surprised that to discover border line heart disease cholesterol levels during a routine blood check when I was 23 years old. I was running and lifting heavy for a few years then and trying to eat “clean” back then. My body didn’t feel as good though, and progress with the weights stalled. I started googling the ways to decrease LDL cholesterol and triglycerides, and stumbled upon Forks Over Knives, Cowspiracy, Rip Esselstyn’s lectures and the China study. Since I was already a huge environmentalist, decreasing animal products in my diet was a no brainer. Over a period of 2 months I went 95% vegan and stick to the plant based diet as well as I possibly can till this day. After doing this for a few years, I’ve been upping my ethical veganism game by veganizing my house, wardrobe and personal care products as well as supporting the local vegan community. I volunteer for Vegfest Expos, speak at local and national vegan festivals and love to help women who want to gain strength without compromising their ethics – on a plant based diet."},{"key":"Competition history","value":["2019 NPC Atlantic Coast Classic (Wilmington, NC), True Novice Bikini Class B – 1st Place, Junior Bikini Class C – 3rd Place, Open Bikini – 5th Place", "2019 OCB Colonial Open (Williamsburg, VA), Bikini Overall – 1st place, Bikini Open C – 2nd place, Bikini Novice A – 1st place, Bikini Debut – 2nd place", "Meet Records: this link has the most accurate numbers. My numbers below can have minor errors since coach and I count in kilos. https://openpowerlifting.org/dist/openipf/u/ekaterinagorbacheva", "2021 USAPL Battle on the Border 377.5 kg / 830 lb total. 2nd Place Open in 69 kg weight class RAW Squat 150.9 kg / 336.2 lb Bench 75kg / 165 lb Deadlift 157.5 kg / 346 lb", "2021 USAPL Power Mt Showdown (Asheville, NC) 387.5kg/ lb 852 lb total 1st Place Open in 69 kg weight class RAW Squat 150kg / 330 lb Bench 77.5 kg / 170.5 lb Deadlift 160kg / 352 lb RAW", "2021 USAPL Virginia Winter Wrecker (Norfolk, VA) 383 kg / 843 lb total Squat 152.5kg / 335.5 lb Bench 77.5 kg /170.5 lb Deadlift 152.5 kg / 382.5 lb 1st place Open in 69 kg weight class RAW", "2022 USAPL Battle on the Border (Denver, NC) 407.5 kg / 898.5 lb total Squat 155kg / 342 lb Bench 85 kg / 187 lb Deadlift 167.5 kg / 369 lb 2nd place Open in 75 kg weight class RAW"]},{"key":"What drives you to compete","value":"uh... I’d get bored otherwise? Lifting is my therapy. Competing is my way to show that I know what I’m talking about. Sadly it’s hard to market coaching services going against large companies selling “30 day to a 6 pack” or other cookie cutter programs. Not to mention “coaches” who post their rear on IG 24/7/365 suggesting one can look the same by doing body weight hip thrusts at home.... There is a difference between posers and competing athletes. My hope is that future clients will see it and be able to tell."},{"key":"What do you see as the biggest advantages of being a vegan athlete","value":"there are none? Or shall I say – there aren’t more than simply being a vegan, or more than being an athlete. We’re not “better”. We just do the best we can and try to keep heads down. I mean it’s cool to see jaws drop when the spectators hear I’m vegan after a 4 plate deadlift but we can’t let this get to our egos."},{"key":"What types of supplements if any do you use?","value":"Creatine, multi, GABA, magnesium, turmeric, resveratrol, ashwagandha, caffeine."},{"key":"How would you describe your diet/nutrition leading up to a meet","value":"in 2021 I was cutting for some meets since my typical weight is 71-72 kg, and my weight class was 69kg. So, a little lower fats a few weeks before the meet, and 20-40 minutes moderate intensity cardio 2-4 / week was enough for me. It can be different for different people. 2022 – I’ve added a few lbs of muscle and +70 lb strength over the past year or two. Now that I’m in a 75 kg category I have been eating higher calorie foods, and higher fat foods day to maintain the weight – avocadoes, higher fats vegan faux meats, nuts. Most week of prep are higher volume too. Things change, bodies change. Funny how it is sometimes – I used to diet for the MAJORITY of my life, now I’m struggling to maintain 72 kg while almost stuffing myself..."},{"key":"Favorite foods/meals","value":"that changes frequently... I make killer seitan https://totalbodylab.com/blog/seitan/! Also any fruits and veggies are a go. Cucumbers from my grandma’s yard... Heirloom tomatoes, apricots from the farmer’s market... Anything with eggplants."},{"key":"How would you describe your training for a competition","value":"It’s DRASTICALLY different for every meet. Typically, my coach Alexei Bakhirev develops a plan for me by the week and I send him videos of each lift. He reviews and writes the next week. I work with my clients the same way – updating program weekly based on VISUAL FEEDBACK, weight, nutrition and other external conditions – stress, traveling, amount of manual labor / cardio (garden, work, kids, pets). We made a documentary after my first meet comparing prep for bodybuilding and powerlifting – if you want more specifics https://youtu.be/sX6O80lUB-8?t=235 Feel free to email me with questions if this answer didn’t satisfy you."},{"key":"Favorite exercises","value":"changes with each prep. I used to like squats, this prep my bench has blown up +12kg. Also I’ve been benching about 80 lifts a week on average so that’s not surprising 😊 down ward dog and stretching feel amazing."},{"key":"How many hours a week do you spend training?","value":"typically 2-4 hour lifts 3 times a week. Can do cardio on top if I feel like responding to emails while on stair master (YOUR NEW SECRET WEAPON!) or in the mood to hike / dance."},{"key":"Today I am most proud of","value":"updating my vegan powerlifting guide and reuploading on totalbodylab.com and organizing gym videos. I film A LOT but rarely publish due to perfectionism. As a result, content gets old and I get self conscious about sharing it. Sometimes small wins make my day 😊"}],
    "sport": "powerlifting",
    "social": [{"key": "Website", "value": "totalbodylab.com"}, {"key": "Instagram", "value": "https://www.instagram.com/gorbachevae"},{"key": "Instagram", "value": "https://www.instagram.com/totalbodylab"}, {"key": "Facebook", "value": "https://www.facebook.com/totalbodylab"}, {"key": "Facebook", "value": "https://www.facebook.com/katyushkazot"}, {"key": "YouTube", "value": "https://www.youtube.com/c/TotalBodyLab"}, {"key": "TikTok", "value": "https://www.tiktok.com/@totalbodylab"}, {"key": "LinkedIn", "value": "https://www.linkedin.com/in/egorbacheva/"}, {"key": "LinkedIn", "value": "https://www.linkedin.com/company/totalbodylab"}]
  },
  {
    "img": "/profile-photos/plantbuilt-kelly-colobella.png",
    "name": "Kelly Colobella",
    "active": true,
    "sport": "kettle-bell-sport",
    "bio": [{"key":"Age","value":"45 (46 by games)"},{"key":"Hometown/city","value":"Salt Lake City, UT"},{"key":"Height","value":"5’5”"},{"key":"Weight", "value": "200lbs"},{"key":"Division(s) you will compete in","value":"Kettlebell"},{"key":"Years as a vegan","value":"28"},{"key":"Why you became a Vegan","value":"Ethical reasons"}],
    "social": []
  },
  {
    "img": "/profile-photos/plantbuilt-kody-kowalowski.png",
    "name": "Kody Kowalowski",
    "active": true,
    "sport": "cf",
    "bio": [{"key":"Age","value":"35"},{"key":"Hometown/city","value":"Clifton Park, NY"},{"key":"Height","value":"6’ 0”"},{"key":"Weight","value":"190 lbs"}, {"key": "Division(s) you will compete in", "value": "Crossfit"},{"key":"Current best lifts, scores, etc","value":"252lb Snatch, 310 lb clean and jerk"},{"key":"Years as a vegan","value":"9"},{"key":"Why you became a Vegan","value":"environment, then ethics, then health"},{"key":"History Competing","value":"Let’s call this coming out of retirement, It’s been a while since I’ve competed but I’ll get back to my former self that was in the top 2% of CrossFit competitors worldwide."},{"key":"What drives you to compete","value":"It’s exciting to measure yourself against people. I’m a competitive person and winning is a major driver of competing. If I happen to lose, it’s an opportunity to evaluate myself and work toward changing a weakness to a strength."},{"key":"What do you see as the biggest advantages of being a vegan athlete","value":"My energy levels are typically higher than most people I see in the gym. The variety of plants I eat keep me fueled to keep pushing harder in training for longer durations."},{"key":"What types of supplements if any do you use?","value":"B12 for good health"},{"key":"How would you describe your diet/nutrition leading up to a competition","value":"I eat intuitively. Nothing changes from my whole foods plant based diet. I continue to not take any supplements."},{"key":"Favorite foods/meals","value":"Panang curry or pizza, both homemade."},{"key":"How would you describe your training for a competition","value":"In general I don’t do anything special for competition prep, I might add an additional training session to get used to the extra volume of a competition day."},{"key":"Favorite exercises","value":"Olympic weightlifting, or any complex barbell movement"},{"key":"How many hours a week do you spend training?","value":"3-4 (Soccer for 1 hour per week, crossfit for 2-3 hours per week)"},{"key":"Today I am most proud of","value":"My life as a whole, having a plant based family of 4 where I don’t focus too much on work or working out and I am able to maintain a high level of fitness while not missing out on all the other things life has to offer. In short, it’s a balanced and rewarding life."}],
    "social": [{"key": "Instagram", "value": "https://www.instagram.com/Kode_green"}]
  },
  {
    "name":"Korin Sutton",
    "img": "/profile-photos/plantbuilt-no-photo.png",
    "active": true,
    "sport": "bodybuilding",
    "bio": [],
    "social": []
  },
  {
    "img": "/profile-photos/plantbuilt-lindsay-morgan.png",
    "name": "Lindsay Morgan",
    "active": true,
    "sport": "olympic-weightlifting",
    "bio": [{ "key": "Name", "value": "Lindsay Morgan. Age" },{ "key": "Hometown/city", "value": "Tulsa, Oklahoma" },{ "key": "Height", "value": "5’4”" },{ "key": "Weight", "value": "67 kg/148 lbs" },{ "key": "Division(s) you will compete in", "value": "64 kg" }, { "key": "Competition Weight", "value": "63.5 kg" }, {"key": "Current best lifts", "value": "Snatch, Clean & Jerk, Back Squat, Front Squat"}, { "key": "Snatch", "value": "58 kg/130 lb" }, { "key": "Clean & Jerk", "value": "77 kg/170 lb" }, { "key": "Back Squat:115 kg/255 lb" }, { "key": "Front Squat", "value": "88kg/195lb" }, { "key": "Years as a vegan", "value": "11 years" }, { "key": "Why you became a Vegan", "value": "I became vegan when I learned about the cruelty to animals and the negative environmental impact of farming animals for human consumption. I want to treat animals as fellow creatures that deserve respect, not as products to be bred and killed for human food. I believe that veganism is a part of a sustainable future that promotes individual health, community health, and health for our planet."}, { "key": "History Competing", "value": "I previously competed in Crossfit in local competitions and with Plantbuilt in the past. This will be my first year competing in Olympic lifting, and my first competition is coming up this month (March 2022)!" }, { "key": "What drives you to compete", "value": "I love practicing new skills and improving myself as an athlete. I am a big believer of being involved in sports throughout the lifespan and not just in youth or college. I am in my 30s and am stronger and more athletic than ever, and I plan to continue training and learning new things for my entire life. Also, I love weightlifting because it is so technical and skill based, it is never ending; you can always improve. I also do partner acrobatics and gymnastics for the same reason. Practicing to do something amazing that requires skill and body control keeps me excited about the sport." }, { "key": "What do you see as the biggest advantages of being a vegan athlete", "value": "Being vegan for health and longevity gives me the nutrition and energy for my athletic lifestyle. I was vegan already before I started any type of strength based sport, so all my gains are vegan and I don’t have any non-vegan personal experience to compare to. However I know that evidence has shown that every meal I eat full of nitrate rich vegetables helps with recovery and performance!" }, { "key": "What types of supplements if any do you use?", "value": "B12, vitamin D, Creatine, plant based protein powder of various brands." }, { "key": "How would you describe your diet/nutrition leading up to a competition", "value": "My diet doesn’t really change that much, I continue to eat a lot of vegetables, fruits, whole grains, beans, tofu, vegan meat replacements, along with the occasional vegan donut or ice cream! My staples are sweet potatoes, beans, and tofu over a salad. If I need to lose weight for a weight class I will count my calories and weigh and measure my food to make sure I am in a caloric deficit, along with counting my macronutrients to make sure they are in a good balance and I am getting enough protein while in a deficit." }, { "key": "Favorite foods/meals", "value": "Burritos with beans and tempeh and veggies, spicy cauliflower tacos, berry protein smoothies, black bean and beet burgers, stuffed sweet potato. My favorite meat replacement is Field Roast. My favorite protein powder is About Time vegan protein in caramel flavor." }, { "key": "How would you describe your training for a competition", "value": "I lift 4-5 days a week which involves variations of the snatch, clean and jerk and squats." }, { "key": "Favorite exercises", "value": "In weightlifting, the clean is my favorite right now. My favorite accessory exercise is handstands. It helps with overhead strength and core stability so I love using handstands to warm up." }, { "key": "How many hours a week do you spend training?", "value": "I train weightlifting 6 or so hours a week, and I also train acrobatics/gymnastics/handstands about 4 hours a week. When training for a weightlifting competition I prioritize my energy towards lifting, and I keep the other stuff at a lower intensity for fun, socializing, and active recovery." }, { "key": "Today I am most proud of", "value": "I just started working full time as a Physical Therapist Assistant last year, and I am proud of the accomplishment of finishing school, studying for the boards exam, and getting a new career all during a pandemic. I am also proud of myself for keeping my health and workouts fairly consistent during all that change in my life." }],
    "social": [{"key": "Instagram", "value": "https://www.instagram.com/lindsaymorganfitness"}, {"key": "Facebook", "value": "https://facebook.com/lindsay.g.morgan"}]
  },
  {
    "name": "Matt Bruce",
    "img": "/profile-photos/plantbuilt-matt-bruce.png",
    "sport": "kettle-bell-sport",
    "active": true,
    "bio": [{"key":"Height","value":"6’0”"},{"key":"Weight","value":"215"},{"key":"Division(s) you will compete in","value":"Kettlebell snatch"},{"key":"Years as a vegan","value":"20 years"},{"key":"Why you became a Vegan","value":"Animals have their own lives, cultures, languages, experiences, and emotions, just like we do. To deny them comfort, care, respect, the right to be happy, or even to raise their own children and pursue what comes natural to them is unjustified in today’s society."},{"key":"History competing","value":"None, other than neighborhood bicycle races in my hometown of Salt Lake City. No places really, super informal. I did win Nightclub Magician of the Year 2 years in a row though!"},{"key":"What drives you to compete","value":"Two things- I want to be part of a team that defeats the notion that vegans are weak or incapable. Secondly, my own redemption from spending the last three years recovering from an accident that left me bedridden and unable to walk for nearly two years. The ability to go from the bed to the platform and compete is very cathartic. I think it serves as a good example for others going through recovery, and those who don’t have to hit those lows to still be successful and build strength with a vegan lifestyle."},{"key":"What do you see as the biggest advantages of being a vegan athlete","value":"Endurance, the examples we set for others, showing the world that success and compassion go hand in hand."},{"key":"What types of supplements if any do you use?","value":"Protein shakes and creatine is all I’ve ever used."},{"key":"How would you describe your diet/nutrition leading up to a competition","value":"I would have to talk to Scott about proper nutrition leading up to the competition, but my typical eating habits are pretty light with the occasional vegan burger or pizza lol"},{"key":"Favorite foods/meals","value":"Basically any bowl with rice, beans, and tofu."},{"key":"How would you describe your training for a competition","value":"Strong emphasis on grip strength and endurance."},{"key":"Favorite exercises","value":"Kettlebell snatch, tricep and bicep exercises, bench, squats, deadlift."},{"key":"How many hours a week do you spend training?","value":"4-6 at least"},{"key":"Today I am most proud of","value":"Getting everything done on my to do list"}],
    "social": [{"key": "Website", "value": "https://www.mattbrucetarot.com/"}, {"key": "Website", "value": "https://www.mattbrucemagic.com"},{"key": "Instagram", "value": "https://www.instagram.com/blastchillerbruce"},{"key": "Instagram", "value": "https://www.instagram.com/mattacadabra"}, {"key": "Instagram", "value": "https://www.instagram.com/tarotmatic"},{"key": "Facebook", "value": "https://www.facebook.com/mattbruce/"}, {"key": "TikTok", "value": "https://www.tiktok.com/@mattacadabra"}]
  },
  {
    "img": "/profile-photos/plantbuilt-matthew-steadman.png", 
    "name": "Matt Steadman", 
    "active": true, 
    "sport": "kettle-bell-sport", 
    "bio": [{"key":"Age","value":"39"},{"key":"Hometown/city","value":"Salt Lake City"},{"key":"Height","value":"5’7”"},{"key":"Weight","value":"165lbs"},{"key":"Competition Weight","value":"165lbs"},{"key":"Current personal records","value":"Jerk, Snatch, and/or Long cycle"},{"key":"Double long cycle 5 minute 20kg -29 reps"},{"key":"Single Kb SNATCH 5 minute 24kg - 100 reps"},{"key":"Years as a vegan","value":"25 years"},{"key":"Why you became a Vegan","value":"At a young age I realized that animals do not hurt us so why should we hurt them."},{"key":"Competition history","value":["Bolt, Kettlebell kings open, north okanagan open 1-3rd in my category"]},{"key":"What drives you to compete","value":"The challenge and the dedication of training."},{"key":"What do you see as the biggest advantages of being a vegan athlete","value":"The recovery to most things seem to be accelerated…"},{"key":"What types of supplements if any do you use?","value":"creatine monohydrate, beet root powder, gnarly protein, multi vitamin and a algae omega…"},{"key":"How would you describe your diet/nutrition leading up to a competition","value":"Right ratios of carbs and protein."},{"key":"Favorite foods/meals","value":"Indian food (vegetable coconut kurma), burritos in many forms, sandwiches in many forms, waffles, big ass salads."},{"key":"How would you describe your training for a competition","value":"Waiving the loads.. Mixing up the volume, intensity etc"},{"key":"Favorite exercises","value":"Turkish get up and the kettlebell snatch"},{"key":"How many hours a week do you spend training?","value":"For kettlebell, 3-5 hours, for jiu jitsu 5hours."},{"key":"Today I am most proud of","value":"The ability to be consistent with my routines and of course my children"}],
    "social": [{"key": "Facebook", "value": "https://www.facebook.com/mattsteadman"}, {"key": "Instagram", "value": "https://www.instagram.com/mattsteadmansandc"}]
  },
  {
    "img": "/profile-photos/plantbuilt-nadege-corcoran.png",
    "sport": "bodybuilding",
    "active": true,
    "name": "Nadege Corcoran",
    "bio": [{"key":"Age","value":"42"},{"key":"Hometown/city","value":"Caraquet New Brunswick Canada"},{"key":"Height","value":"5’4"},{"key":"Weight","value":"120"},{"key":"Division(s) you will compete in","value":"Bikini- bodybuilding"},{"key":"Years as a vegan","value":"10 years in March 2022"},{"key":"Why you became a Vegan","value":"I always wanted to be vegan. At 5 years old I would cry that I had to eat animals. It was always in me, we just didn’t know ow a word for it and people thought (and made me believe) you needed animal as food to survive. Fast forward to my late 20s and I started realizing was living with disease and it was exactly that… my body was “not at ease”. As soon as I started moving towards a plant based lifestyle its like the stars were aligning. My soul, my mind and my body were all in agreement. So I became vegan overnight."},{"key":"Competition history","value":["15 shows","27 categories","14 top 3 placings including 6x 1st place."]},{"key":"What drives you to compete:"},{"key":"I want to not just say but show that veganism is not only a great way of life, its an optimal way of life."},{"key":"What do you see as the biggest advantages of being a vegan athlete:"},{"key":"My love of vegetables, in all seriousness it’s the recovery. Even in very low caloric diets, my nutrients stay really high in comparison."},{"key":"What types of supplements if any do you use?:"},{"key":"Omega oils, b12, d, creatine, BCAA sometimes. And if counted.. protein powder"},{"key":"How would you describe your diet/nutrition leading up to a show:"},{"key":"A diet of military precision. Not one gram goes unaccounted for. And also… locked in so that if doesn’t taste great but it has the right macros… it is what it is and it’s fine."},{"key":"Favorite foods/meals","value":"Protein powder!!!!! I will do anything for some Caramel Coffee Profi!"},{"key":"How would you describe your training for a competition","value":"Very similar to standard Bikini bodybuilding with the extra added bonus of training for long races to get my cardio done. Of course I am not an elite runner, but I hold my own and when lean down starts it’s like we let the horse out of the barn!"},{"key":"Favorite exercises","value":"Probably the hip thrust."},{"key":"How many hours a week do you spend training?","value":"5 hours ish of lifting and depending on cardio it adds another 2 to infinite hours 😅"},{"key":"Today I am most proud of","value":"My consistency."}],
    "social": [{"key": "Instagram", "value": "https://www.instagram.com/nadegecorcoran"}, {"key": "Facebook", "value": "https://www.facebook.com/nadege.corcoran"}]
  },
  {
    "img": "/profile-photos/plantbuilt-ndem-nkem.png",
    "name": "Ndem Nkem",
    "sport": "powerlifting",
    "active": true,
    "bio": [{"key":"Name","value":"Ndem Nkem"},{"key":"Age","value":"38"},{"key":"Hometown/city","value":"Portland,Oregon"},{"key":"Height","value":"6’1 Weight"},{"key":"Division(s) you will compete in","value":"242, 275"},{"key":"Competition Weight","value":"varies"},{"key":"Years as a vegan","value":"10 years"},{"key":"Why you became a Vegan","value":"I became vegan for a different way of eating. During my first year of going vegan, i learned what happened to animals, and it’s been ethical ever since. I don’t want contribute to the suffering of animals."},{"key":"Competition history","value": ["2015 1st place 275 class chris duffin powerlifting meet Clackamas ,oregon", "2015 naturally fit games 275 class austin , texas", "2017 naturally fit games 275 class austin, texas"]},{"key":"What drives you to compete","value":"pushing your limits and improving as an athlete."},{"key":"What do you see as the biggest advantages of being a vegan athlete","value":"lifting from a place of compassion and understanding."},{"key":"What types of supplements if any do you use?","value":"b12, vitamin d, and protein powder."},{"key":"How would you describe your diet/nutrition leading up to a meet","value":"doesn’t change much. I like to continue to enjoy the foods i love and see results."},{"key":"Favorite foods/meals","value":"Mangoes,lentils, smoothies, stir fry and black bean burritos."},{"key":"How would you describe your training for a competition","value":"training becomes more strength-focused and more energy on the big three lifts (squats, bench press, and deadlifts)"},{"key":"Favorite exercises","value":"deadlifts"},{"key":"How many hours a week do you spend training?","value":"it depends on my goals. At moment I spend three to four training."},{"key":"Today I am most proud of","value":"pushing myself to be my best. With all the things that have happened in the world, I’m happy; regardless of whatever happens, I always make my way back to lifting."}],
    "social": [{"key": "Website", "value": "https://www.eatalltheveganfood.com/"}, {"key": "Website", "value": "https://hotchocolatefitness.com/"}, {"key": "Instagram", "value": "https://www.instagram.com/ndem.nkem"}, {"key": "Instagram", "value": "https://www.instagram.com/eatalltheveganfood"}, {"key": "Facebook", "value": "https://www.facebook.com/hotchocolatefitness"}, {"key": "Facebook", "value": "https://www.facebook.com/eatalltheveganfood"}, {"key": "YouTube", "value": "https://www.youtube.com/channel/UCYAGDl-NFb3AODzxL8fdQ9w"}, {"key": "TikTok", "value": "https://www.tiktok.com/@ndem.nkem"}, {"key": "TikTok", "value": "https://www.tiktok.com/@heyitsndem"}]
  },
  {
    "img": "/profile-photos/plantbuilt-nick-squires.png",
    "name": "Nick Squires",
    "active": true,
    "sport": "powerlifting",
    "bio": [{"key":"Name","value":"Nick Squires"},{"key":"Age","value":"35"},{"key":"Hometown/city","value":"Sacramento, California"},{"key":"Height","value":"5’9”"},{"key":"Weight","value":"230lbs"},{"key":"Division(s) you will compete in","value":"100kg raw open men’s, full power"},{"key":"Competition Weight","value":"220lbs"},{"key":"Current max lifts:"},{"key":"Bench/Squat/Deadlift","value":"415/650/675"},{"key":"Years as a vegan","value":"7 years, will be 8 in May"},{"key":"Why you became a Vegan","value":"I was spending a lot of time working with bully breed dogs as part of a rescue, fostering/rehabilitiating them so they could be rehomed. I had a moment where I realized I was spending time/money/energy on helping some animals while contributing to the death and suffering of others, just because they were a different species. We adopted a dog named Wilbur who reminded me so much of a cow that I couldn’t bring myself to eat beef anymore. As soon as I realized that about one animal it led me to start eliminating all animal products from my life."},{"key":"History competing","value":"I have been competing since 2016, with 3 1st place finishes at local open meets. I started focusing on larger meets and have first place finishes in California and World drug tested championships, taking 1st at the 2019 Drug Tested World Championships in Limerick, Ireland. At my most recent meet in 2021 I set 4 california state records in the submaster 100kg raw open."},{"key":"What drives you to compete","value":"Every time I log in to social media I see people still claiming that vegans are malnourished, weak, scrawny, that plant protein isn’t sufficient for basic nutrition, let alone competitive powerlifting. Each time I step on that platform I’m aiming to put that idea to rest."},{"key":"What do you see as the biggest advantages of being a vegan athlete","value":"My message since day one hasn’t been that veganism gives me an advantage as an athlete, (though I do notice an advantage when it comes to more cardiovascular pursuits like when I’m playing ice hockey) but rather that being a vegan athlete does not put me at a disadvantage, even in such a protein-dependent sport like Powerlifting."},{"key":"What types of supplements if any do you use?","value":"I have used the same supplements since before I went vegan – 1 scoop of protein (now a rice/pea blend instead of whey) and 5g of creatine a day. My supplementation needs did not change as a vegan."},{"key":"How would you describe your diet/nutrition leading up to a meet","value":"Heading into a meet I’m generally focusing on cutting weight for the weigh in, so my diet a couple weeks out gets much cleaner than it is during the majority of my training. Lots of tofu and broccoli!"},{"key":"Favorite foods/meals","value":"Before going vegan I was all about comfort food – burgers, pizza, burritos, soul food – and the best part was, when I went vegan that didn’t have to change! I love coming home from a long training session and making a veganized double bacon western cheeseburger."},{"key":"How would you describe your training for a competition","value":"My coach and I set a plan for the meet and he designs a program to focus on my weaknesses. 8 weeks ahead of the meet we start a program designed to help me peak on meet day."},{"key":"Favorite exercises","value":"Deadlift. Coming into benching and squat, which I still love, there are a million cues and judge’s commands you have to focus on. Deadlift is just about going all out and getting that weight off the ground."},{"key":"How many hours a week do you spend training?","value":"4 days a week, about 2 hours a day, with many more hours a week focused on recovery and nutrition."},{"key":"Today I am most proud of","value":"Setting 4 state records in 2021 was big for me. There’s always naysayers, people who will try to negate what you’re doing, but putting 4 records in the books in a state this size, you can’t take that away from me."}],
    "social": [{"key": "Instagram", "value": "https://www.instagram.com/meatymcsorley"}, {"key": "YouTube", "value": "https://www.youtube.com/c/meatymcsorley"}]
  },
  {
    "name": "Noah Hannibal",
    "img": "/profile-photos/plantbuilt-noah-hannibal.png",
    "sport": "powerlifting",
    "active": true,
    "bio": [{"key":"Age","value":"45"},{"key":"Hometown/city","value":"Melbourne, Australia"},{"key":"Height","value":"190cm / 6’2”"},{"key":"Weight","value":"120kg / 265lb"},{"key":"Division(s) you will compete in","value":"125kg/275lb (if it is a 265lb weight class I will compete at 265, sorry not sure about pound divisions)"},{"key":"Competition Weight","value":"265lb/275lb depending on division"},{"key":"Current max lifts","value":"Competing bench only - Current max lift is 200kg/440lb in drug tested competition"},{"key":"Years as a vegan","value":"30+"},{"key":"Why you became a Vegan","value":"I’m fortunate to have been vegetarian from birth. I’ve always loved animals and when I learned that the dairy and egg industries cause just as much, if not more, animal suffering as the meat industry, it was an easy decision to go vegan."},{"key":"Competition history","value":["2021: Oceania Championships, 1st Place", "2020: Australian Powerlifting Championships, 4th Place", "2011: Australian Powerlifting Championships, 2nd Place", "2011: Australian Raw Bench Press Championships, 1st Place", "2010: Australian Bench Press Championships, 1st Place"]},{"key":"What drives you to compete","value":"I initially got into strength training because a massive bodybuilder I knew was mocking vegans as weaklings, and saying it was impossible to get strong without meat. So I challenged him to an arm wrestle, which was the source of much mockery at the time. I was given three months to train and on the day of the arm wrestle everyone laughed and said I had no hope. To the surprise of all, myself included, I slammed his hand to the table and he had to eat his words that vegans can’t be strong. That actually fueled my fire to start competing and show that you can be optimally healthy and strong as a vegan. Since then I have won two Australian Bench Press Championships in the heavyweight category, and represented Australia internationally, winning the Oceania Heavyweight Bench Press Championship, all in drug tested competition. I am now chasing a national Masters record at the Australian Championships later this year."},{"key":"What do you see as the biggest advantages of being a vegan athlete","value":"It’s hard to gauge since I’ve never trained as a non vegan athlete, but compared to non vegan athletes I feel like my recovery is much better. I train with some quite brutal bench programs like Smolov Jr back to back, which destroys a lot of people, and don’t get too wrecked by it. I also feel like it helps with longevity in the sport, around my age powerlifters can start to lose strength, whereas I’m currently the strongest I’ve ever been."},{"key":"What types of supplements if any do you use?","value":"I tend to keep it pretty simple, soy protein and creatine are my staples. Before a big training session I will add some citrulline malate to my preworkout shake. And caffeine is my drug of choice. Non training related, I make sure to get my B12 of course!"},{"key":"How would you describe your diet/nutrition leading up to a meet","value":"If I’m not trying to make weight it’s pretty unstructured. The main thing is I make sure to get a minimum of 200g of protein per day spread over four meals (at least one of which is a protein shake), focusing a lot on seitan, tofu, tempeh, soy protein, tvp, plant meats and legumes, along with a good serving of vegetables and some healthy grains."},{"key":"Favorite foods/meals","value":"There are so many, I’m a sucker for vegan junk food, pizza, burritos, jaffles, bagels, lasagne, but I also love my healthier home made staples like sauerkraut, soy yoghurt, and broccoli sprouts. And I’m a seitan evangelist."},{"key":"How would you describe your training for a competition","value":"I respond well to short 4-6 week programs heavy on volume and intensity, Smolov Jr and variations are ones I use a lot. Because I’m a bench specialist I also concentrate on a lot of back, tricep and shoulder assistance exercises, tapering down in the lead up to a meet."},{"key":"Favorite exercises","value":"That would be the king of lifts, the bench press"},{"key":"How many hours a week do you spend training?","value":"I typically strength train three times a week and the time spent varies, but usually about an hour and a half per session."},{"key":"Today I am most proud of","value":"In the strength arena I would say helping to smash ignorant stereotypes about veganism, such as that you can’t be strong without meat and other animal products. It feels great to lift heavy weights and cause people to reconsider any anti-vegan attitudes they might hold."}],
    "social": [{"key": "Website", "value": "https://www.noah.org.au/"}, {"key": "Instagram", "value": "https://www.instagram.com/thevegantank"}, {"key": "Facebook", "value": "https://www.facebook.com/noah.hannibal/"}, {"key": "YouTube", "value": "https://www.youtube.com/c/vegantank"}]
  },
  {
    "img": "/profile-photos/plantbuilt-paul-salomone.png",
    "name": "Paul Salomone",
    "active": false,
    "sport": "powerlifting"
  },
  {
    "name":"Ramona Cadogan",
    "img": "/profile-photos/plantbuilt-ramona-cadogan.png",
    "active": true,
    "sport": "olympic-weightlifting",
    "bio": [{"key":"Age","value":"51"},{"key":"Hometown/city","value":"Far Rockaway, NY"},{"key":"Height","value":"5’4”"},{"key":"Weight","value":"140 lb"},{"key":"Division(s) you will compete in","value":"50-54 Women’s 64kg weight class"},{"key":"Competition Weight","value":"135-140 lb"},{"key":"Current best lifts","value":"Snatch - 60 kg / Clean Jerk - 76 kg / Back Squat - 120 kg / Front Squat - 102 kg"},{"key":"Years as a vegan","value":"16"},{"key":"Why you became a Vegan","value":"I did not want to eat animals. I respect them as living organisms"},{"key":"Competition history","value":["2016 Masters Nationals - Silver", "2017 American Masters - Gold", "2018 PanAm Masters - Gold", "2019 World Cup - Silver", "2021 PanAm Masters - Silver"]},{"key":"What drives you to compete","value":"I love being on stage. I love to thrive in an audience"},{"key":"What do you see as the biggest advantages of being a vegan athlete","value":"I feel healthier than when I ate meat. More energy."},{"key":"What types of supplements if any do you use?","value":"Purium"},{"key":"How would you describe your diet/nutrition leading up to a competition","value":"I balance out my carbs. Not to overcome and and reduce sugar."},{"key":"Favorite foods/meals","value":"Raw vegan lasagna"},{"key":"How would you describe your training for a competition","value":"My coach has been doing different variations of the lifts to target my areas of improvement"},{"key":"Favorite exercises","value":"Snatch, Turkish getups, chin-ups"},{"key":"How many hours a week do you spend training?","value":"6-8 hrs"},{"key":"Today I am most proud of","value":"Being grateful and overcoming an injury to my knee with confidence by using the Feldenkrais method to heal my ACL in my right knee. Trusting the process."}],
    "social": [{"key": "Website", "value": "https://www.academicbreakthroughcoaching.com/"}, {"key": "Instagram", "value": "https://www.instagram.com/nyambassadorteamgreen63kg"}, {"key": "Facebook", "value": "https://www.facebook.com/holisticvegan"}, {"key": "LinkedIn", "value": "https://www.linkedin.com/in/ramonacadogan/"}]
  },
  {
    "name": "Riccardo Scomparin",
    "img": "/profile-photos/plantbuilt-riccardo-scomparin.png",
    "active": true,
    "sport": "cf",
    "bio": [{"key":"Age","value":"30"},{"key":"Hometown/city","value":"Rho (Milan), Italy"},{"key":"Height","value":"195cm"},{"key":"Weight","value":"105kg Division(s) you will compete in"},{"key":"Competition Weight","value":"105"},{"key":"Current best lifts, scores, etc","value":"Snatch 117.5kg, Clean and jerk 130kg, Split Jerk 150kg, Back squat 170kg, Deadlift 220kg, Max unbroken pull-ups 35, Max unbroken muscle-ups 18 1km run 3:50 min Max calk bike 1 min 75"},{"key":"Years as a vegan","value":"3"},{"key":"Why you became a Vegan","value":"Because I opened my eyes to what eat animals have to go thru for me to have a meal and decided that I didn’t want to contribute to their suffering anymore"},{"key": "Competition history", "value":["Fittest Man in Indonesia Crossfit Open 2018", "Strength in Depth London, First Crossfit Sanction event", "Battle of the Alps, 1st place", "Lots of competitions in Bali we either won or got top 3"]},{"key":"What drives you to compete","value":"I’ve been a competitor my whole life, from swimming and skiing when I was a kid to 16 years of basketball (7 of which as a pro) competition has always been part of my fitness journey. I guess I just enjoy testing all the work I do behind the scenes."},{"key":"What do you see as the biggest advantages of being a vegan athlete","value":"Recovery. Is much faster and much deeper. I rarely stretch, I don’t use any fancy recovery tool and I don’t even feel the need. I’ve been off any injury/pain ever since I went vegan, joints inflammation is gone and with having no pain and better recovery of course you can train better and longer, ence you can become a better athlete."},{"key":"What types of supplements if any do you use?","value":"B12, protein in our morning smoothie"},{"key":"How would you describe your diet/nutrition leading up to a competition","value":"I don’t normally count or weight my food, all I do is to make sure I eat enough to sustain performance as that’s the most important aspect of my kind of competition."},{"key":"Favorite foods/meals","value":"I’m a big burgers (vegan, ofc) lover as long as most of my eating is clean, that way I can enjoy some “cheat” meal when I want them. I also love love love cold press juices, I have them nearly everyday!"},{"key":"How would you describe your training for a competition","value":"If it’s a competition I know and that has been on for some time I look at what they have previously done to get an idea of what to expect and then include some of those elements in my training. However CrossFit motto is “be ready for the unknown” so my best chances are always to be as prepared as in can in all aspect of fitness so that whatever workout they throw at us I can do my best in it."},{"key":"Favorite exercises","value":"Love me some heavy snatches! I also enjoy cardio machines and wall balls...like every tall big athlete ahah"},{"key":"How many hours a week do you spend training?","value":"When the focus is on Crossfit I do 90 to 120 min 6 days a week, when I focus on Ironman training I end-up training an average of 3-4 hours a day as I have long runs and bike rides as well."},{"key":"Today I am most proud of","value":"That for another day in my life no animals had to suffer because of my decisions"}],
    "social": [{"key": "Instagram", "value": "https://www.instagram.com/rickyscomparin"}, {"key": "Facebook", "value": "https://www.facebook.com/riccardo.scomparin/"}, {"key": "YouTube", "value": "https://www.youtube.com/channel/UCusULGmWt8LFNSi8OqWK6wQ"}]

  },
  {
    "name":"Ryan Stills",
    "img": "/profile-photos/plantbuilt-no-photo.png",
    "active": true,
    "sport": "powerlifting",
    "bio": [],
    "social": []
  },
  {
    "name":"Sally Anderson",
    "img": "/profile-photos/plantbuilt-no-photo.png",
    "active": true,
    "sport": "cf",
    "bio": [],
    "social": []
  },
  {
    "name":"Sasha Perry",
    "img": "/profile-photos/plantbuilt-no-photo.png",
    "active": true,
    "sport": "kettle-bell-sport",
    "bio": [],
    "social": []
  },
  {
    "name":"Sara Russert",
    "active": false,
    "bio": [{"key": "test", "value": "123"}],
    "sport": "bodybuilding",
    "social": [{"key": "Website", "value": "https://github.com/sarabeth-russert/plantbuilt"}, {"key": "Instagram", "value": "https://www.instagram.com/sara_russert"}, {"key": "Facebook", "value": "https://www.facebook.com/sarabethxvx/"}, {"key": "LinkedIn", "value": "https://www.linkedin.com/in/sararussert/"}],
    "img": "/profile-photos/plantbuilt-sara-russert.png"
  },
  {
    "name":"Seraphina Schinner",
    "img": "/profile-photos/plantbuilt-no-photo.png",
    "active": true,
    "sport": "olympic-weightlifting",
    "bio": [],
    "social": []

  },
  {
    "img": "/profile-photos/plantbuilt-scott-green.png",
    "name": "Scott Green",
    "active": true,
    "sport": "kettle-bell-sport",
    "bio" : [{"key": "Age","value": 45}, {"key": "Hometown/city" ,"value": "hometown New Orleans, current city Los Angeles"}, {"key": "Height" ,"value": "6’1”"}, {"key": "Weight" ,"value": 185},  {"key": "Competition Weight", "value": "85kg"}, {"key": "Division" ,"value": "long cycle or triathlon"}, {"key": "Years Vegan", "value": 20}, {"key": "Why you became vegan", "value": "I was exposed to veganism through punk and hardcore. I chose a straightedge lifestyle at 14, so I was drawn to straightedge bands and then vegan straightedge bands. I went vegetarian my first year of college, but at the time thought veganism was extreme. 2.5 years later, I realized how ridiculous that thought was as I dove deeper into learning about animal agriculture and animal rights. It was only logical that I took the next step to oppose murder, torture, and rape. I then saw the correlations in other struggles, and ever since, I believe in and fight for Animal, Earth, Human, And Self Liberation. All struggles are one."}, {"key": "Competition history", "value": ["2013 OKC California Open Championship - 1st Place Longcycle", "2013 IKFF New Orleans Kettlebell Sport Championship - 2nd Place Longcycle", "2013 OKC Bay Area Kettlebell Competition - 1st Place Longcycle", "2015 OKC California Open Kettlebell Sport Championship - 3rd Place Longcycle", "2015 AKA Southwest Regional Kettlebell Championship - 2nd  Place Longcycle", "2017 AKA Southwest Regional Kettlebell Championship - 1st Place Snatch", "2018 OKC California Open/World Championship - 1st Place Snatch", "2018 OKC California Open/World Championship - 1st Place Longcycle"]}, {"key": "What drives you to compete", "value": " I'm actually not a very competitive person. For me, competition is always against myself. That is one of the reasons that I was drawn to the kettlebell sport. In kettlebell sport, you have to dig deep to fight the voices in your head that tell you to drop the bells. It's more mental strength than physical strength. By setting goals for competition, it's the difference between just working out and training. You train with purpose to reach a specific goal. It creates the drive to push yourself further. The process is what drives me more than the competition itself. I always strive to better myself and become more than what I was yesterday."}, {"key": "Biggest advantages to being a vegan athlete", "value": "That's a little hard for me to say. When I competed in Kung Fu as well as kettlebell sport, I was already vegan, so I can't really compare my athleticism to being non-vegan. I will say that it gives me a sense of peace to know that my performances are not fueled by murder."}, {"key": "Supplements you use", "value": "I don't use many supplements. I like chocolate Green Regimen Elite protein powder, and I take creatine monohydrate."}, {"key": "Describe your pre-competition diet", "value": "I pretty much eat the same year round but may increase or decrease caloric intake based on phase of training cycle and goals I'm trying to achieve."}, {"key": "Favorite foods", "value": "My go to these days are burritos/burrito bowls. I've just been on a big kick where that's what I'm craving a lot. "}, {"key": "How you train", "value": "I train 5-6 days a week. The beginning of each training session is 10-15 minutes of CARS(controlled articular rotations), then depending on the day whatever FRC(functional range conditioning) that I need to focus on to keep my joints mobile, strong, and healthy. Then depending on the day either kettlebell training or cardio training. After the kettlebell training, I will follow it up with whatever accessory strength training exercises I need. Ideally kettlebell and weight training 3 days a week and cardiovascular training 3 days a week."}, {"key": "Favorite Exercises", "value": "Pails/Rails, Longcycle, snatch, deadlift, squat, swings, bodyweight movements, bulgarian bag work, mace work, other kettlebell work, martial arts…I like a lot of exercises"}, {"key": "Hours a week spent training", "value": "9-12 hours"}, {"key": "Most proud of", "value": "The improvements in the clients that I train, both mentally and physically. I love helping people achieve goals that they don’t think that they can accomplish."}],
    "social": [{"key": "Website", "value": "https://www.selfliberationstrength.com/"}, {"key": "Instagram", "value":"https://www.instagram.com/ScottGreenXVX"}, {"key": "Facebook","value": "https://www.facebook.com/scott.green.522"}]
  },
  {
    "name": "Sophie Brock", 
    "img": "/profile-photos/plantbuilt-sophie-mcbride.png",
    "sport": "cf",
    "active": true,
    "bio": [{"key":"Age","value":"30"},{"key":"Hometown/city","value":"Colorado Springs, CO"},{"key":"Height","value":"5’4"},{"key":"Weight","value":"140"},{"key":"Division(s) you will compete in","value":"CrossFit"},{"key":"Current best lifts, scores, etc","value":"Deadlift"},{"key":"Years as a vegan","value":"9"},{"key":"Why you became a Vegan","value":"I’m an animal lover! Went vegetarian at 9 as soon as I understood that I was eating animals. Went vegan at 22 when I watched “What the Health” and saw the awful conditions and death involved with dairy and eggs as well."},{"key":"History Competing","value":"I have been competing in strength sports since 2015, beginning with Strongman. In the years since I have dabbled in Bodybuilding and Olympic Weightlifting, and jumped deeper into CrossFit and Powerlifting. I currently hold the Colorado state records in the deadlift and total for powerlifting. I have podiumed at three local CrossFit competitions, and took 11th at my first pro event in 2018. At the same competition the next year I competed on a team and we took third. I had big plans for 2020 before covid hit, so I’m excited to get back into some big competitions this year!"},{"key":"Your ranking","value":"Currently sitting in 1,431st in the US after one workout in the CF open."},{"key":"What drives you to compete","value":"For one I have just always loved the feeling. There’s nothing else quite like game day adrenaline. What keeps me going every day is showing others that you can be strong and fit on a vegan diet."},{"key":"What do you see as the biggest advantages of being a vegan athlete","value":"My recovery is great! I can sustain a very high volume of training because my body can recover from it quickly, thanks to the clean fuel I give it. Getting fitter or stronger all comes down to how well you are recovering and I don’t think there’s anything better for recovery than good sleep and a WFPB diet."},{"key":"What types of supplements if any do you use?","value":"I use a plant based protein powder and a multi vitamin. Have used creatine here and there."},{"key":"How would you describe your diet/nutrition leading up to a competition","value":"Mostly whole-food plant-based, with a few vegan treats when I mentally need it. Lots of carbs! Oats, sweet potatoes, and fruit are my go-to fuels."},{"key":"Favorite foods/meals","value":"I love brunch! Tofu scramble, pancakes or waffles, and an oatmilk latte to top it off. I also really love fruit!"},{"key":"How would you describe your training for a competition","value":"Fun and intense. In the off season there is a lot more controlled strength work and lower intensity aerobic work, then the few months before competition I dial up the intensity."},{"key":"Favorite exercises","value":"Power cleans, box jumps, and rope climbs!"},{"key":"How many hours a week do you spend training?","value":"Currently 10-15. Will be at the higher end of that or above leading into competition."}],
    "social": [{"key": "Instagram", "value": "https://www.instagram.com/coach_sophie_b"}]
  },
  {
    "img": "/profile-photos/plantbuilt-tiffany-burich.png",
    "name": "Tiffany Burich",
    "active": true,
    "sport": "bodybuilding",
    "bio": [{"key":"Age","value":"40"},{"key":"Hometown/city","value":"Miami, FL"},{"key":"Height","value":"5’5”"},{"key":"Weight","value":"125 lb"},{"key":"Division(s) you will compete in","value":"Figure & Physique"},{"key":"Years as a vegan","value":"14"},{"key":"Why you became a Vegan","value":"Ethical Vegan. Received a PETA magazine in the mail, the topic was about “downer cows”. I was immediately horrified & started researching — the rest is history"},{"key":"Competition history","value":["2013 INBF NaturallyFit. Figure - 3rd place", "2014 INBF NaturallyFit. Figure - 3rd place", "2014 INBF NaturallyFit. Figure - 3rd place"]},{"key":"What drives you to compete","value":"Pushing myself to be better, while showing how strong & muscular you can be on a Plants only diet."},{"key":"What do you see as the biggest advantages of being a vegan athlete","value":"Better recovery, more energy, & all the carbs"},{"key":"What types of supplements if any do you use?","value":"Protein powder (1 scoop / once per day)"},{"key":"How would you describe your diet/nutrition leading up to a show","value":"6 small meals of carbs & protein w/very little fat (my body responds better to carbs than fat)"},{"key":"Favorite foods/meals","value":"“Mindful chick’n” by Sweet Earth"},{"key":"How would you describe your training for a competition","value":"Starts out with a lot more straight lifting than more cardio as show approaches. Always mixing it up & do legs 3x/wk & shoulders 2x/wk"},{"key":"Favorite exercises","value":"Various types of lunges. Any shoulder exercise"},{"key":"How many hours a week do you spend training?","value":"7-12 depending on the week & exercises. Always one full rest day to recover."},{"key":"Today I am most proud of","value":"Being a part of this movement & bringing together the athletes from all over to showcase this lifestyle"}],
    "social": [{"key": "Instagram", "value": "https://www.instagram.com/TiffanyBurich"}, {"key": "Facebook", "value": "https://www.facebook.com/NoExcusesTrainer/"}]
  },
  {
    "name": "Torre Washington",
    "img": "/profile-photos/plantbuilt-torre-washington.png",
    "active": false,
    "sport": "bodybuilding",
    "bio": [{"key":"Legacy Team Member","value":"Bio accurate in 2017"},{"key":"Division you will compete in", "value": "Bodybuilding"},{"key":"Age", "value": "38"},{"key":"Height", "value":"5’7”"},{"key":"Weight","value":"160lbs"},{"key":"City", "value": "Moody"},{"key":"Years as a vegan", "value": "15+yrs"},{"key":"Why you became a Vegan","value":"Was a “vegetarian” and decided to just take it to the next level, but I did not know that there was a name or label to eat this way. As a Rasta “Ital” = natural was a way of life, and I wanted to live it to the fullest."},{"key":"History competing","value":["2009 SNBF – 3rd", "2009 SNBF – 1st place/overall winner Pro Card", "2011 SNBF Pro show – 3rd", "2011 Musclemania Miami – 3rd", "2011 SNBF – 5th", "2012 IFPA Pro Show – 3rd", "2012 SNBF Pro Show – 2nd", "2012 Musclemania Miami – 2nd"]},{"key":"What drives you to compete","value":"The drive to compete is to be better than I was the previous year and to always improve upon any weaknesses and the enjoyment of being on stage putting on a show!, for the crowd."},{"key":"What do you see as the biggest advantages of being a vegan athlete","value":"Recovery, food variety, ease of getting sliced and diced(shredded). Breaking the norm."},{"key":"How would you describe your diet while preparing for a competition","value":"Simple it is not a “diet” it is the same way that I eat year round, and the only changes if any are that I do less beans and fruit. The key is to make it a lifestyle."},{"key":"Favorite food in your prep diet","value":"Baked Tofu"},{"key":"How would you describe your training for a competition","value":"Heavy, High volume with drop sets and supersets."},{"key":"Favorite exercises","value":"Squats to the ground, Heavy Shrugs, Bent Over Rows, and Stiff Legged Deadlifts."},{"key":"How many hours a week do you spend training?","value":"5hrs"},{"key":"Today I am most proud of","value":"Squat to the floor “Tom Platz” style with a Heavy weight."}],
    "social": [{"key": "Website", "value": "https://www.torrewashington.com/"}, {"key": "Instagram", "value": "https://www.instagram.com/torre.washington"}, {"key": "Facebook", "value": "https://www.facebook.com/TorreWashingtonOfficial"}, {"key": "Twitter", "value": "https://twitter.com/torrewofficial"}]
  },
  {
    "name": "Tui Van Renterghem",
    "img": "/profile-photos/plantbuilt-tui-van-renterghem.png",
    "sport": "cf",
    "active": true,
    "bio": [{"key":"Age","value":"30"},{"key":"Hometown/city","value":"Finland"},{"key":"Height","value":"175cm"},{"key":"Weight","value":"70kg"},{"key":"Division(s) you will compete in","value":"Crossfit"},{"key":"Current best lifts, scores, etc","value":"Deadlift 150kg, Back Squat 120kg, Snatch 75kg, Clean & Jerk 87,5kg"},{"key":"Years as a vegan","value":"7years"},{"key":"Why you became a Vegan","value":"For the animals. I saw footage of a slaughter house and from that moment, I knew I could not support that ever again and so decided to stop eating meat. Then I quickly learned how the egg industry, dairy industry, and other animal industries operate and I decided to go vegan. Even that, at the time, I was bodybuilding and eating a diet packed with animal products. I decided I’d figure it out!"},{"key":"Competition history", "value":["2020 Wanderlust The Fittest", "1st place, 2020 Bali Barong Games 2nd place", "2019 You C 1000, Battle Of The Fittest", "Top 10, 2019 WOD Of Jakarta, 3rd place"]},{"key":"What drives you to compete","value":"I love to challenge myself and always improve. Comps are the place where you push past your limits and give it your all! My why is to show the world that you can be strong, healthy, and fit AF without needing to harm animals or the planet."},{"key":"What do you see as the biggest advantages of being a vegan athlete","value":"Higher energy levels, faster recovery, leaner body composition, better overall health - and for myself, a big one is the peace that comes from knowing my diet is not harming other beings, and is aligned with my values."},{"key":"What types of supplements if any do you use? Vitamin B12, Creatine, Iodine, Omega 3 (from algae), protein powder"},{"key":"How would you describe your diet/nutrition leading up to a competition","value":"Very much the same as always. I follow a mainly WFPB diet so the base is a large variety of fruits & veg, legumes, grains, nuts and seeds. I am very relaxed with my diet, I also enjoy some sweets and processed foods when I feel like it. The most important thing for me is to eat enough, get some protein throughout the day, and get in lots of high vibe rainbow foods."},{"key":"Favorite foods/meals","value":"Smoothie bowls & Buddha bowls"},{"key":"How would you describe your training for a competition","value":"In Crossfit, you need to be fit overall in all areas as they can test you pretty much on anything in a competition. The base work is done long before the comp, and the training leading to the competition gets more competition specific as of shorter higher intensity workouts."},{"key":"Favorite exercises","value":"The Snatch! And heavy lifting. I also love rowing and burpees... I love all the movements honestly! :D"},{"key":"How many hours a week do you spend training? About 12!"},{"key":"Today I am most proud of","value":"Living my dream life to the fullest, aligned with my values & inspiring the world together with my strong vegan husband Ricky!"}],
    "social": [{"key": "Website", "value": "https://www.thevegancrossfitgirl.com"}, {"key": "Instagram", "value": "https://www.instagram.com/thevegancrossfitgirl"}, {"key": "Facebook", "value": "https://www.facebook.com/thevegancrossfitgirl"}, {"key": "YouTube", "value": "https://www.youtube.com/c/TheVeganCrossfitGirl"}]
  },
  {
    "img": "/profile-photos/plantbuilt-will-tucker.png",
    "name": "Will Tucker",
    "active": true,
    "sport": "bodybuilding",
    "bio": [{"key":"Name","value":"Will Tucker"},{"key":"Age","value":"51"},{"key":"Hometown/city","value":"East St. Louis, IL by way of Mesa, AZ"},{"key":"Height","value":"5’7”"},{"key":"Weight","value":"150 lb"},{"key":"Division(s) you will compete in","value":"Men’s Bodybuilding Open, Masters, Pro"},{"key":"Competition Weight","value":"150-155 lb"},{"key":"Years as a vegan","value":"10 1/2"},{"key":"Why you became a Vegan","value":"After being vegetarian for 5yrs, I worked to go animal free to see how my recovery would be. It improved so much I never looked back"},{"key":"What drives you to compete","value":"To show the world you don’t need to consume animal products to be your best"},{"key":"What do you see as the biggest advantages of being a vegan athlete","value":"A clear conscience knowing I achieved my physique with harm"},{"key":"What types of supplements if any do you use?","value":"None"},{"key":"How would you describe your diet/nutrition leading up to a show","value":"Intermittent fasting"},{"key":"Favorite foods/meals","value":"Smoothies, Bowls"},{"key":"Favorite exercises","value":"Bench presss"},{"key":"How many hours a week do you spend training?","value":"7-8"},{"key":"Today I am most proud of","value":"My son"}],
    "social": [{"key": "Instagram", "value": "https://www.instagram.com/willtuckerfitness"}]
  }
]




